In [1]:
import pandas as pd
data=pd.Series([0.25,0.5,0.75,1])
data
data.values[1:3] #.values is like a array
#series包頭不包尾 所以1沒出現

array([0.5 , 0.75])

In [2]:
#加標題
data=pd.Series([0.25,0.5,0.75,1],index=['a','b','c','d'])
data
array=['1','2','3','4'] #標題可以預先寫好
data=pd.Series([0.25,0.5,0.75,1],index=array)
data

1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

# DATAFRAME就是一堆Series物件
# series跟dict結構一樣

In [5]:
import pandas as pd
cities= pd.read_csv('uscities.csv',encoding='utf-8')
city=cities[['city','state_id','lat', 'lng']]
city.to_html('test.html')

# 建立DATAFRAME

In [8]:
city1=cities['city']
pd.DataFrame(city1,columns=['city'])

                          city
0                     New York
1                  Los Angeles
2                      Chicago
3                        Miami
4                       Dallas
...                        ...
30839                Ironville
30840                  Newkirk
30841           Falcon Village
30842             Hidden Lakes
30843  El Monte Mobile Village

[30844 rows x 1 columns]

# list comprehension

In [11]:
data=[{'a':i,'b':2*i} for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

# pd can join dict

In [17]:
pd.DataFrame({'a':1,'b':2},{'b':3,'c':4})

   a  b
b  1  2
c  1  2

In [19]:
# 會自動把空值變成NaN 有[]才能取聯集 有兩個element (dict) 的 list
pd.DataFrame([{'a':1,'b':2},{'b':3,'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [16]:
# 有標題列
dict1={'a':1,'b':2}
dict2={'b':3,'c':4}
a=pd.DataFrame({'dict1':dict1,'dict2':dict2})
#append的括法 只是沒有append

         a    b    c
dict1  1.0  2.0  NaN
dict2  NaN  3.0  4.0

# 設定標題列

In [20]:
import numpy as np
pd.DataFrame(np.random.rand(3,2),columns=['foo','bar'],index=['a','b','c'])

        foo       bar
a  0.266602  0.314420
b  0.088036  0.601091
c  0.431592  0.268906

# DATAFRAME 轉置

In [ ]:
city.T

# DATAFRAME copy

In [ ]:
# dataframe slice is a point to the original dataframe, when you change the slice, the original one will be changed as well.
# to have a new dataframe, you need to use dataframe.copy

# DATAFRAME conditional operation

In [ ]:
# drop
city1=city.drop(columns='is_open')

#dropna and dropduplitcate is not useful, list(set()) is much more helpful, but set is not sequential.

#select fancy index
city=cities[['city','state_id','lat', 'lng']]

# merge it is like join in SQL
dfnew = pd.merge(city,cities,how='left',on = ['city','state'])

KeyError: "None of [Int64Index([3, 7, 4], dtype='int64')] are in the [columns]"

# 欄位在分群時很好用

# LOC

In [27]:
import pandas as pd
import json
business=pd.read_json('business.json')
business.groupby('state').size().index
Index=['AZ', 'CA', 'CO', 'DE', 'FL', 'HI', 'ID', 'IL', 'IN', 'LA', 'MA', 'MI',
       'MO', 'NJ', 'NV', 'PA', 'SD', 'TN', 'TX', 'UT', 'VT', 'WA']
bu=business[['name','address','categories','city','state','latitude','longitude','stars']]
WA=[]
state='WA'
# bu.loc[100]['state']
for i in range(len(bu)):
        if (bu.loc[i]['state'])=="WA":
            WA.append({
                'name':bu.loc[i]['name'],
                'address':bu.loc[i]['address'],
                'city':bu.loc[i]['city'],
                'category':bu.loc[i]['categories'],
                'stars':bu.loc[i]['stars'],
                'latitude':bu.loc[i]['latitude'],
                'longitude':bu.loc[i]['longitude'],
            })
with open(f"map/{state}.json", "w", encoding="utf-8") as file:
    file.write(json.dumps(WA, ensure_ascii=False, indent=4))

# 轉置 特性 
# 資料是 橫的 用
### file = open('ww.json','r',encoding='utf-8')
### lines = file.readlines()
### file.close()
# 資料是 橫的 用pandas

In [63]:
test=WA.T
file = open('ww.json','r',encoding='utf-8')
lines = file.readlines()
file.close()
businesslist = [json.loads(i) for i in lines]
business

,business_id,name,address,city,state,postal_code,latitude,longitude,stars,is_open,categories,hours
0,mpf3x-BjTdTEA3yCZrAYPw,The UPS Store,87 Grasso Plaza Shopping Center,Affton,MO,63123,38.551126,-90.335695,3.0,1,"Shipping Centers, Local Services, Notaries, Ma...","{'Monday': '0:0-0:0', 'Tuesday': '8:0-18:30', ..."
1,MTSW4McQd7CbVtyjqoe9mw,St Honore Pastries,935 Race St,Philadelphia,PA,19107,39.955505,-75.155564,4.0,1,"Restaurants, Food, Bubble Tea, Coffee & Tea, B...","{'Monday': '7:0-20:0', 'Tuesday': '7:0-20:0', ..."
2,mWMc6_wTdE0EUBKIGXDVfA,Perkiomen Valley Brewery,101 Walnut St,Green Lane,PA,18054,40.338183,-75.471659,4.5,1,"Brewpubs, Breweries, Food","{'Wednesday': '14:0-22:0', 'Thursday': '16:0-2..."
3,CF33F8-E6oudUQ46HnavjQ,Sonic Drive-In,615 S Main St,Ashland City,TN,37015,36.269593,-87.058943,2.0,1,"Burgers, Fast Food, Sandwiches, Food, Ice Crea...","{'Monday': '0:0-0:0', 'Tuesday': '6:0-22:0', '..."
4,n_0UpQx1hsNbnPUSlodU8w,Famous Footwear,"8522 Eager Road, Dierbergs Brentwood Point",Brentwood,MO,63144,38.627695,-90.340465,2.5,1,"Sporting Goods, Fashion, Shoe Stores, Shopping...","{'Monday': '0:0-0:0', 'Tuesday': '10:0-18:0', ..."
...,...,...,...,...,...,...,...,...,...,...,...,...
115346,2O2K6SXPWv56amqxCECd4w,The Plum Pit,4405 Pennell Rd,Aston,DE,19014,39.856185,-75.427725,4.5,1,"Restaurants, Comfort Food, Food, Food Trucks, ...","{'Monday': '0:0-0:0', 'Tuesday': '0:0-0:0', 'W..."
115347,c8GjPIOTGVmIemT7j5_SyQ,Wild Birds Unlimited,2813 Bransford Ave,Nashville,TN,37204,36.115118,-86.766925,4.0,1,"Pets, Nurseries & Gardening, Pet Stores, Hobby...","{'Monday': '9:30-17:30', 'Tuesday': '9:30-17:3..."
115348,_QAMST-NrQobXduilWEqSw,Claire's Boutique,"6020 E 82nd St, Ste 46",Indianapolis,IN,46250,39.908707,-86.065088,3.5,1,"Shopping, Jewelry, Piercing, Toy Stores, Beaut...",None
115349,mtGm22y5c2UHNXDFAjaPNw,Cyclery & Fitness Center,2472 Troy Rd,Edwardsville,IL,62025,38.782351,-89.950558,4.0,1,"Fitness/Exercise Equipment, Eyewear & Optician...","{'Monday': '9:0-20:0', 'Tuesday': '9:0-20:0', ..."
115350,jV_XOycEzSlTx-65W906pg,Sic Ink,238 Apollo Beach Blvd,Apollo beach,FL,33572,27.771002,-82.394910,4.5,1,"Beauty & Spas, Permanent Makeup, Piercing, Tattoo","{'Tuesday': '12:0-19:0', 'Wednesday': '12:0-19..."

# 處理缺失值 (None nan null)

In [1]:
import pandas as pd
import numpy as np
vals1=np.array([1,None,3,4])
vals1
# 因為None是python物件 所以資料型態變成最大的物件

array([1, None, 3, 4], dtype=object)

In [2]:
vals2=np.array([1,np.nan,3,4])
vals2.dtype
#NaN 1.不分大小寫 2.是浮點數型態 3.nan跟任何東西做運算都會變成nan

dtype('float64')

In [ ]:
# 尋找空值的方法
# isnull() notnull()

# 拋棄空值 只能拋棄一整欄或一整列

In [ ]:
# dropna 預設拋棄列
# dropna(axis='colunms')  拋棄行
# df.dropna(how='all') # any 是有空值就拋棄 all 全為空值才拋棄
# tresh=3 表示空值超過3個會被 """保留"""

# 填入空值

In [3]:
data=pd.Series([1,np.nan,2,None,3], index=list('abcde'))
data.fillna(0) #空值都轉成0
data.fllna(method='ffill') # forward fill 用前一個值來填
data.fllna(method='bfill') # forward fill 用後一個值來填
data.fillna(method='ffill', axis=1) #指定用列來填

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

# 資料集的合併 Concat(可指定join) merge, [append不建議使用]

In [5]:
import pandas as pd
import numpy as np
def make_df(cols,ind):
    '''快速產生一個DataFrame'''
    data = {c:[str(c)+str(i) for i in ind] for c in cols}  #list comprehension
    return pd.DataFrame(data,ind)
make_df('ABC',range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

### Join

In [ ]:
#join
df5=make_df('abc',[1,2]) #丟入欄跟index
df6=make_df('abc',[3,4])
pd.concat([df5,df6],join="inner") #預設是聯集 outer , inner是交集
pd.concat([df5,df6],join_axes=[df5.columns]) #指定欄位

In [7]:
import pandas as pd
# 不merge也可以合併
df1=pd.DataFrame({'employee':['Bob','Jake','Lisa','Sue'],'group':['Accounting','Engineering','Engineering','HR']})
df2=pd.DataFrame({'employee':['Lisa','Bob','Jake','Sue'],'hire_date':[2004,2008,2012,2014]})

In [8]:
df3=pd.merge(df1,df2) # join的方式與SQL相同 employee是foreign key
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [12]:
# many on one
df4=pd.DataFrame({'group':['Accounting','Engineering','HR'],'supervisor':['carly','guido','steve']})
df4=pd.merge(df3,df4)
df4 #多對一的地方在supervisor資料量比employee少,卻能join 是透過group把他們合起來

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      carly
1     Jake  Engineering       2012      guido
2     Lisa  Engineering       2004      guido
3      Sue           HR       2014      steve

In [25]:
# many to many
df5=pd.DataFrame({'group':['Accounting','Accounting','Engineering','Engineering','HR','HR'],'skill':['math','spreadsheets','coding','linux','spreadsheets','organization']})
df5=pd.merge(df4,df5)
df5 #配合1人有多個技能 所以其他資料配合最多的資料長出來
pd.merge(df1,df2,on='employee') # (on就是explict的join)
#欄名不同 資料相同 告訴merge誰合誰
df3=pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'],'salary':[70000,80000,120000,90000]})
df3
pd.merge(df1,df3,left_on="employee",right_on="name") #兩個相同的欄位都會出現 要自己drop

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

### 用途不明

In [26]:
df1;df2
pd.merge(df1,df2, left_index=True,right_index=True)

  employee_x        group employee_y  hire_date
0        Bob   Accounting       Lisa       2004
1       Jake  Engineering        Bob       2008
2       Lisa  Engineering       Jake       2012
3        Sue           HR        Sue       2014

### Group by (split,apply,combine)

In [28]:
df=pd.DataFrame({'key':['A','B','C','A','B','C'],'data':range(6)},columns=['key','data'])
df #{}是series columns 是 explict 指定欄名

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [30]:
df.groupby('key')#本身沒用 要用的的是他的method
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [32]:
import numpy as np
rng=np.random.RandomState(0)
df=pd.DataFrame({'key':['a','b','c','a','b','c'],'data1':range(6),'data2':rng.randint(0,10,6)},columns=['key','data1','data2'])
#randint是產生6個 0~10的亂數
df

  key  data1  data2
0   a      0      5
1   b      1      0
2   c      2      3
3   a      3      3
4   b      4      7
5   c      5      9

In [34]:
#aggregate method 同時操作2個資料集
df.groupby('key').aggregate([min,np.median,max])
# apply()裡面可以放自訂方法

    data1            data2
      min median max   min median max
key
a       0    1.5   3     3    4.0   5
b       1    2.5   4     0    3.5   7
c       2    3.5   5     3    6.0   9

In [36]:
L=[0,1,0,1,2,0]
df
df.groupby(L).sum()
# groupby 2 次 L指示的是在data中的位置
# 先groupby L 以0為例 表示欄名稱為0 然後加總 0 所在位置 1,3,6=>0,2,5=7

C:\Users\student\AppData\Local\Temp\ipykernel_9580\1237571019.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(L).sum()

   data1  data2
0      7     17
1      4      3
2      4      7